Revit 2027 API
ConnectorElement.ChangeHostReference(Reference) Method
 Changes the connector host reference to a new planar face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ChangeHostReference(
	Reference planarFace
)
Public Sub ChangeHostReference (
	planarFace As Reference
)
public:
void ChangeHostReference(
	Reference^ planarFace
)
member ChangeHostReference :
        planarFace : Reference -> unit
Parameters
planarFace Reference
 The planar face to place the connector on.
Exceptions
Exception | Condition
ArgumentException |  The face is not a planar face.
ArgumentNullException |  A non-optional argument was null
Remarks
 The connector referenced by a planar face alone is placed at the plane origin, and may be moved later along the planar face.
See Also
Reference
ConnectorElement Class
ChangeHostReference Overload
Autodesk.Revit.DB Namespace